blog/3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-13 Sun 20:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP. 1.2.1</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP. 1.2.1
<br />
<span class="subtitle">2022-11-13 Sun</span>
</h1>
<p>
Two meanings of `recursive' are distinguished. On the one hand, this
word can be used to refer to <i>processes</i> that display a certain type
of evolution. On the other hand, this word can be used to refer to
procedures that display a certain syntactic feature. A recursive
procedure does not always generate a recursive process.
</p>

<p>
Moreover, recursive processes are distinguished from <i>iterative</i>
processes. One way to discover whether a process is recursive or
iterative is to look at the ``shape'' we would draw if we employed the
substitution model. Another way to see whether a process is recursive
or iterative is to check whether, at any point of its evolution,
knowing the state of the program variables is enough to know the state
of the process at that point. If so, the process is
iterative. Otherwise, it is recursive.
</p>

<p>
The concept of <i>tail recursion</i> is introduced.
</p>

<div id="outline-container-orgc51da8f" class="outline-2">
<h2 id="orgc51da8f">Exercise 1.9</h2>
<div class="outline-text-2" id="text-orgc51da8f">
<p>
Exercise: 
</p>
<blockquote>
<p>
Each of the following two procedures defines a method for adding two
positive integers in terms of the procedures inc, which increments its
argument by 1, and dec, which decrements its argument by 1.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">+</span> a b)
  (<span style="color: #b9ca4a;">if</span> (= a 0) 
      b 
      (inc (+ (dec a) b))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">+</span> a b)
  (<span style="color: #b9ca4a;">if</span> (= a 0) 
      b 
      (+ (dec a) (inc b))))
</pre>
</div>

<p>
Using the substitution model, illustrate the process generated by each
procedure in evaluating (+ 4 5). Are these processes iterative or
recursive?
</p>
</blockquote>

<p>
Answer:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(+ 4 5)
(inc (+ 3 5))
(inc (inc (+ 2 5)))
(inc (inc (inc (+ 1 5))))
(inc (inc (inc (inc (+ 0 5)))))
(inc (inc (inc (inc 5))))
(inc (inc (inc 6)))
(inc (inc 7))
(inc 8)
9
</pre>
</div>
<p>
Judging by its shape, it looks like we are dealing with a recursive
process!
</p>

<div class="org-src-container">
<pre class="src src-scheme">(+ 4 5)
(+ 3 6)
(+ 2 7)
(+ 1 8)
(+ 0 9)
9
</pre>
</div>
<p>
Judging by its shape, it looks like we are dealing with an iterative
process!
</p>
</div>
</div>

<div id="outline-container-org100108d" class="outline-2">
<h2 id="org100108d">Exercise 1.10</h2>
<div class="outline-text-2" id="text-org100108d">
<p>
Exercise:
</p>
<blockquote>
<p>
The following procedure computes a mathematical function called Ackermann’s function.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">A</span> x y)
  (<span style="color: #b9ca4a;">cond</span> ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (<span style="color: #b9ca4a;">else</span> (A (- x 1)
                 (A x (- y 1))))))
</pre>
</div>
<p>
What are the values of the following expressions?
</p>

<div class="org-src-container">
<pre class="src src-scheme">(A 1 10)
(A 2 4)
(A 3 3)
</pre>
</div>

<p>
Consider the following procedures, where A is the procedure defined above:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">f</span> n) (A 0 n))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">g</span> n) (A 1 n))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">h</span> n) (A 2 n))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">k</span> n) (* 5 n n))
</pre>
</div>
<p>
Give concise mathematical definitions for the functions computed by
the procedures <code>f</code>, <code>g</code>, and <code>h</code> for positive integer values of
<code>n</code>. For example, <code>(k n)</code> computes \(5n^2\).
</p>
</blockquote>

<p>
Answer:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">let's see the evolution of (A 1 10):</span>

(A 1 10)

(A 0 (A 1 9))

(A 0 (A 0 (A 1 8)))

(A 0 (A 0 (A 0 (A 1 7))))

(A 0 (A 0 (A 0 (A 0 (A 1 6)))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 1 5))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 4)))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 3))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 2)))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 1))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 2)))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 4))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 8)))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 16))))))

(A 0 (A 0 (A 0 (A 0 (A 0 32)))))

(A 0 (A 0 (A 0 (A 0 64))))

(A 0 (A 0 (A 0 128)))

(A 0 (A 0 256))

(A 0 512)

1024

</pre>
</div>
<p>
We are looking at a recursive process. The answer is 1024.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">Let's do the same with (A 2 4).</span>

(A 2 4)

(A 1 (A 2 3))

(A 1 (A 1 (A 2 2)))

(A 1 (A 1 (A 1 (A 2 1))))

(A 1 (A 1 (A 1 2)))

(A 1 (A 1 (A 0 (A 1 1))))

(A 1 (A 1 (A 0 2)))

(A 1 (A 1 4))

(A 1 (A 0 (A 1 3)))

(A 1 (A 0 (A 0 (A 1 2))))

(A 1 (A 0 (A 0 (A 0 (A 1 1)))))

(A 1 (A 0 (A 0 (A 0 2))))

(A 1 (A 0 (A 0 4)))

(A 1 (A 0 8))

(A 1 16)

(A 0 (A 1 15))

(A 0 (A 0 (A 1 14)))

(A 0 (A 0 (A 0 (A 1 13))))

(A 0 (A 0 (A 0 (A 0 (A 1 12)))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 1 11))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 10)))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 9))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 8)))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 7))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 6)))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 5))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 4)))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 3))))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 2)))))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 1))))))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 2)))))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 4))))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 8)))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 16))))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 32)))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 64))))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 128)))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 256))))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 512)))))))

(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 1024))))))

(A 0 (A 0 (A 0 (A 0 (A 0 2048)))))

(A 0 (A 0 (A 0 (A 0 4096))))

(A 0 (A 0 (A 0 8192)))

(A 0 (A 0 16384))

(A 0 32768)

65536
</pre>
</div>
<p>
Interesting shape&#x2026; the answer is 65536.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">Let's see now the evolution of (A 3 3):</span>

(A 3 3)

(A 2 (A 3 2))

(A 2 (A 2 (A 3 1)))

(A 2 (A 2 2))

(A 2 (A 1 (A 2 1)))

(A 2 (A 1 2))

(A 2 (A 0 (A 1 1)))

(A 2 (A 0 2))

(A 2 4) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">We already know this one!</span>

65536
</pre>
</div>
<p>
Again 65536.
</p>

<p>
<code>(f 1)</code> is 2:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(f 1)

(A 0 1)

2
</pre>
</div>

<p>
<code>(f 2)</code> is 4:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(f 2)

(A 0 2)

4
</pre>
</div>

<p>
<code>(f 3)</code> is 6:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(f 3)

(A 0 3)

(A 6)
</pre>
</div>

<p>
I conclude that <code>(f n)</code> computes \(n \times 2\).
</p>

<p>
<code>(g 1)</code> is 2:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(g 1)

(A 1 1)

2
</pre>
</div>

<p>
<code>(g 2)</code> is 4:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(g 2)

(A 1 2)

(A 0 (A 1 1))

(A 0 2)

4
</pre>
</div>

<p>
<code>(g 3)</code> is 8:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(g 3)

(A 1 3)

(A 0 (A 1 2)) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">we already know that (A 1 2) is 4</span>

(A 0 4)

8
</pre>
</div>

<p>
<code>(g 4)</code> is 16:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(g 4)

(A 1 4)

(A 0 (A 1 3)) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">we already know that (A 1 3) is 8</span>

(A 0 8)

16
</pre>
</div>

<p>
Those are the powers of two. I conclude that <code>(g n)</code> computes \(2^n\).
</p>


<p>
<code>(h 1)</code> is 2:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(h 1)

(A 2 1)

2
</pre>
</div>

<p>
<code>(h 2)</code> is 4:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(h 2)

(A 2 2)

(A 1 (A 2 1))

(A 1 2)

(A 0 (A 1 1))

(A 0 2)

4
</pre>
</div>

<p>
<code>(h 3)</code> is 16:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(h 3)

(A 2 3)

(A 1 (A 2 2))

(A 1 (A 1 (A 2 1)))

(A 1 (A 1 2))

(A 1 (A 0 (A 1 1)))

(A 1 (A 0 2))

(A 1 4) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">we already know that (A 1 4) is 16</span>

16
</pre>
</div>

<p>
<code>(h 4)</code> is 65536.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(h 4)

(A 2 4) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">we know this one already...</span>

65536
</pre>
</div>

<p>
<code>(h 5)</code> is &#x2026;
</p>
<div class="org-src-container">
<pre class="src src-scheme">(h 5)

(A 2 5)

(A 1 (A 2 4)) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(A 2 4) is 65536</span>

(A 1 65536)

(A 0 (A 1 65535))

(A 0 (A 0 (A 1 65635))) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">oh oh... this would take a while...</span>
</pre>
</div>

<p>
<code>(h 4)</code> is \(65536\), which is \(2^{16}\). <code>(h 3)</code> is \(16\), which is
\(2^4\). <code>(h 2)</code> is \(4\), which is \(2^2\). My answer, then, is that <code>(h
n)</code> computes \(n^{(h (1- n)))}\) where `(h (1- n))` is the application
of <code>h</code> to <code>n</code> minus 1.
</p>

<div style="text-align: center;">
<a href="https://pietroiusti.github.io/blog/posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Please, send send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> if you have any comment.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</span></p>
</div>
</body>
</html>
